package com.lm.jbm.utils;

import java.util.Properties;
import java.util.Random;
import java.util.concurrent.ConcurrentHashMap;

import org.apache.commons.lang.StringUtils;


public class RandomUtil {
	
	public static ConcurrentHashMap<String, String> ipMap = new ConcurrentHashMap<String, String>(512);
	public static ConcurrentHashMap<String, Integer> nameMap = new ConcurrentHashMap<String, Integer>(512);
	public static ConcurrentHashMap<String, String> remarkMap = new ConcurrentHashMap<String, String>(512);
	public static ConcurrentHashMap<String, String> briMap = new ConcurrentHashMap<String, String>(512);
	
	public static final String[] ips = {
		"120.15.129.116",
		"120.15.4.153",
		"120.193.158.191",
		"120.193.252.165",
		"120.202.118.182",
		"120.229.126.113",
		"120.229.131.203",
		"120.236.173.194",
		"120.236.61.218",
		"120.239.162.72",
		"120.239.18.81",
		"120.3.163.113",
		"120.3.234.98",
		"120.37.40.248",
		"120.4.9.208",
		"120.85.87.211",
		"121.10.59.164",
		"121.17.117.104",
		"121.20.217.180",
		"121.207.17.218",
		"121.207.75.150",
		"121.22.243.245",
		"121.224.183.7",
		"121.226.252.223",
		"121.227.1.141",
		"121.236.119.229",
		"121.238.36.79",
		"121.32.193.217",
		"121.33.175.154",
		"121.33.33.32",
		"121.33.48.182",
		"121.35.202.244",
		"121.62.184.209",
		"121.62.220.178",
		"121.69.46.134",
		"122.143.20.117",
		"122.192.14.237",
		"122.195.136.228",
		"122.224.34.147",
		"122.224.52.36",
		"122.228.60.34",
		"122.233.110.59",
		"122.244.50.63",
		"122.70.145.82",
		"122.96.42.246",
		"122.97.178.254",
		"123.103.15.11",
		"123.115.99.157",
		"123.13.204.151",
		"123.135.243.129",
		"123.138.153.149",
		"123.138.228.69",
		"123.138.232.232",
		"123.147.244.34",
		"123.147.244.9",
		"123.147.244.9",
		"123.147.246.240",
		"123.147.250.44",
		"123.149.34.105",
		"123.149.86.129",
		"123.15.160.155",
		"123.158.205.63",
		"123.171.13.100",
		"123.179.253.46",
		"123.4.118.106",
		"123.52.219.74",
		"123.5.232.76",
		"123.7.30.22",
		"124.116.241.2",
		"124.126.224.207",
		"124.129.196.244",
		"124.130.85.237",
		"124.135.104.179",
		"124.160.153.157",
		"124.160.212.242",
		"124.160.215.131",
		"124.160.219.246",
		"124.163.231.180",
		"124.164.243.162",
		"124.165.143.70",
		"124.166.38.248",
		"124.200.106.90",
		"124.207.50.227",
		"124.227.55.95",
		"124.228.155.100",
		"124.228.19.2",
		"124.238.204.156",
		"124.239.251.104",
		"124.31.62.173",
		"124.72.51.198",
		"124.90.187.192",
		"125.39.30.150",
		"125.45.231.86",
		"125.65.222.210",
		"125.71.55.207",
		"125.72.45.119",
		"125.73.78.10",
		"125.73.93.29",
		"125.75.76.235",
		"125.76.128.22",
		"125.76.135.79",
		"125.79.67.34",
		"125.80.188.52",
		"125.82.186.104",
		"125.85.186.160",
		"125.85.186.242",
		"125.85.186.242",
		"125.91.49.46",
		"125.94.232.239",
		"139.189.155.142",
		"139.205.228.250",
		"139.206.193.130",
		"139.212.219.226",
		"139.214.99.241",
		"140.206.89.57",
		"140.240.27.172",
		"144.0.22.188",
		"153.34.21.235",
		"163.179.0.136",
		"171.105.232.113",
		"171.105.34.84",
		"171.106.2.173",
		"171.109.182.49",
		"171.111.92.32",
		"171.115.151.83",
		"171.11.72.195",
		"171.12.1.96",
		"171.12.3.222",
		"171.13.187.183",
		"171.221.143.69",
		"171.38.246.157",
		"171.40.144.106",
		"171.44.174.24",
		"171.8.18.185",
		"171.82.219.228",
		"175.12.144.223",
		"175.12.96.248",
		"175.146.37.22",
		"175.149.68.54",
		"175.15.144.13",
		"175.167.174.168",
		"175.167.58.70",
		"175.17.22.148",
		"175.19.130.101",
		"175.19.130.171",
		"175.19.51.75",
		"175.19.53.35",
		"175.19.54.85",
		"175.43.183.139",
		"180.103.220.111",
		"180.104.230.154",
		"180.126.145.67",
		"180.143.82.69",
		"180.156.41.51",
		"180.162.177.172",
		"180.230.36.94",
		"180.95.195.223",
		"181.92.139.166",
		"182.105.47.111",
		"182.114.5.88",
		"182.127.142.234",
		"182.139.208.155",
		"182.147.56.144",
		"182.151.166.74",
		"182.203.155.146",
		"182.207.216.61",
		"182.247.251.136",
		"182.38.140.20",
		"182.41.114.1",
		"182.45.29.7",
		"182.85.15.66",
		"182.90.221.44",
		"182.90.223.166",
		"182.97.184.200",
		"183.0.91.25",
		"183.150.36.177",
		"183.154.177.3",
		"183.157.160.24",
		"183.158.222.38",
		"183.162.3.2",
		"183.167.178.172",
		"183.167.211.11",
		"183.1.77.113",
		"183.197.43.127",
		"183.198.201.17",
		"183.198.34.195",
		"183.202.161.249",
		"183.202.208.190",
		"183.202.209.46",
		"183.202.209.6",
		"183.202.64.200",
		"183.204.45.180",
		"183.205.135.97",
		"183.205.140.166",
		"183.206.175.12",
		"183.208.28.180",
		"183.211.184.75",
		"183.212.144.28",
		"183.213.207.73",
		"183.214.111.243",
		"183.214.147.37",
		"183.214.190.220",
		"183.214.23.146",
		"183.2.200.135",
		"183.22.25.98",
		"183.223.149.17",
		"183.225.68.137",
		"183.226.14.109",
		"183.226.166.115",
		"183.234.194.30",
		"183.236.19.69",
		"183.236.19.71",
		"183.240.19.216",
		"183.240.20.215",
		"183.240.27.27",
		"183.245.221.2",
		"183.248.81.83",
		"183.35.203.141",
		"183.36.31.230",
		"183.39.53.112",
		"183.40.6.167",
		"183.50.98.82",
		"183.53.132.133",
		"183.95.51.69",
		"202.109.166.216",
		"202.109.166.219",
		"202.109.166.220",
		"209.35.30.20",
		"210.21.228.212",
		"210.21.228.212",
		"210.21.68.3",
		"211.142.199.85",
		"211.142.221.152",
		"211.94.234.248",
		"220.168.132.206",
		"220.171.138.111",
		"220.172.55.43",
		"220.175.19.104",
		"220.184.23.239",
		"220.195.64.152",
		"220.195.64.45",
		"220.195.65.74",
		"220.198.240.236",
		"220.202.152.78",
		"221.11.63.186",
		"221.13.63.104",
		"221.180.251.171",
		"221.192.179.30",
		"221.193.0.135",
		"221.193.193.131",
		"221.197.245.8",
		"221.203.194.187",
		"221.207.37.106",
		"221.207.37.41",
		"221.209.36.45",
		"221.211.86.146",
		"221.2.225.190",
		"221.7.7.44",
		"222.189.192.112",
		"222.216.23.140",
		"222.246.184.92",
		"222.38.200.108",
		"222.69.184.130",
		"222.79.238.126",
		"222.88.203.108",
		"222.92.1.198",
		"222.92.159.206",
		"223.10.141.224",
		"223.10.147.45",
		"223.104.12.208",
		"223.104.12.70",
		"223.104.15.207",
		"223.104.170.145",
		"223.104.170.145",
		"223.104.170.84",
		"223.104.17.242",
		"223.104.177.150",
		"223.104.189.229",
		"223.104.189.78",
		"223.104.22.107",
		"223.104.238.99",
		"223.104.24.153",
		"223.104.24.162",
		"223.104.255.163",
		"223.104.63.166",
		"223.104.63.237",
		"223.104.63.252",
		"223.104.94.43",
		"223.104.94.62",
		"223.104.95.48",
		"223.104.95.84",
		"223.112.202.134",
		"223.112.202.207",
		"223.113.11.166",
		"223.113.52.12",
		"223.11.45.131",
		"223.153.22.140",
		"223.155.170.13",
		"223.199.219.245",
		"223.208.105.35",
		"223.214.51.211",
		"223.215.82.233",
		"223.220.140.154",
		"223.220.140.53",
		"223.64.74.185",
		"223.73.135.81",
		"223.73.135.98",
		"223.73.238.211",
		"223.73.60.165",
		"223.73.60.22",
		"223.74.109.11",
		"223.74.34.19",
		"223.74.82.240",
		"223.74.82.59",
		"223.75.11.148",
		"223.79.82.212",
		"223.84.205.137",
		"223.86.232.9",
		"223.86.85.71",
		"223.89.189.176",
		"223.96.157.115",
		"223.97.132.216",
		"223.99.54.188",
		"223.99.57.166"
	};
	
	public static String[] remark = {"美美哒~~","么么哒!~~","不离不弃","永远爱你！","哈哈哈哈~","再见","明年会改变","不要不理我", "滚","真特么的曹蛋","有本事你别走","来啊，干","什么瘠薄玩意","大理司招生","千言万语",
			"晴儿美美的","小傻瓜","爱不够啊","心相随","你不走我就留","期待！！！","无形无影","天天睡懒觉，日日更健康","五十度","天哥不只是说说的，你看吧","大言不惭，本人都懒得屌你","真是煞笔，什么人都有","恶心到我了，啥x",
			"mt有真美女么？","大哥果然在很豪爽，哈哈哈哈","留下人来，你走开","那个妹子，哥哥好喜欢","新人我喜欢","别来烦我"};
	public static String[] one = {"恩","黑","毒","傲","浪","秽","妍","沅","瞳","谁","柒","歖","譆","枯","安","瞒","等","黏","殇.","渗","憐","嗯","囍","放","沉","瘾","叚","槿","怂",
			"吟","碍","寂","呸","敷","绝","嘘","奢","逗","凉","昔","遇","素","饿","亡","噬","單","暮","瞳","岛","窿","嚎","傲","高","欢","乐","野","骚","蔍","曦","朤","私","艺","美",
			"酥","离","烈","腻","癮","废","青","醉","孽","憩","槿","悸","独","走","沸","毁","帅","朝","统","怹","狂","装","宥","止","茜","盲","稚","毒","黎","亂","肆","精","柠","噩",
			"陌","殘","伪","噤","丧","嘘","癮","废","傀","惜","孽","槿","悸","隐","碎","疚","怼","藥","咒","浪","怂","朕","哑","闹","辜","劫","俗","傲","魂","戏","慕","白","堕","墓",
			"忌","烬","隅","慦 ","怣","忐","忑","蜕","哄","倦","爬","久"};
	public static String[] two = {"初柚*","散落","良辰","倒带","叛逆","脆弱","孤刺","禁锢","深碍","遣心","丑态","游魂","情丝","依赖",
			"空城","浪潮","转角","独瘾","断点","衬心","妄念","夏末","猫弦","浊泪","浅笑","救赎","失意","流苏","配角","热水",
			"湉晨","北觅","东寻","戒躁","消逝","过客","无畏","征途","心抑","魇九","深腻","寒潮","听孤","薄荷","清晓","风尘",
			"纵行","凉墨","寡言","偏执","涟漪","旖旎","南笙","皆叹","二哥。","三哥*","五哥·","十三","啊疼","阿~爽","啊~不要","啊~你来",
			"奶包","巴卫","锦鲤","春野","棠绾","南音","良辰","君赋","抬举","闲云","念旧","单杀","孽徒",
			"过客","君顾","殊荣","逆战","情言","误叹","木白","夏目","折枝′","楹曦","雾月","疚爱","颤吻","单野","眼杂","玄鸟","苏烟","零帝","择终","杼惘","初弋","衣冢","恋土",
			"庸俗","山丘","院长","猎场","莫离","文少","点点","永平","微笑","暗恋","旧情","多余","情殇","救赎","腾龙","良生","霸道","回头","莫逆","颜熙","寻欢","河北","毒药","十七","无趣","温情","縌亂",
			"嘿嘿","沐北","管我","錆酒","情仙","北梦","妄为","仄言","寒塘","哈喽","王宁","尐希","清君","十一","也许","陈晨","韬哥","山鬼","怪咖","义哥","俏皮","残冬","林熙","猫性",
			"狂飙","殊荣","参商","冷漠","痞笑","空痕","柚子","情兽","野病","泪奔","无心","杰杰","月华","呵呵","共勉","换心","污啊","不合",
			"小生","城府","啊呀","焱焱","断情","厌倦"};
	public static String[] thr = {"大黑仔","我是谁","我在哪","好厉害","啊~疼疼","啊~爽爽","啊~不要",
			"啊~哎哟","啊~来吧","·啊~不来","啊·管你呢","嘿嘿·不黑","小·果粉","大·啊哥","随便·啦","你好呀·","我不好~·","哇塞·大","哇塞·深","哇塞·白","哇塞·。。",
			"厉害·哥","好随便·","欢迎你·","啊·欢迎我","嗯·不欢迎你","啊·到底欢不欢迎","不黑不黑","天天吃豆子","不要吧·","可以的啊·","蜜桃小忠粉",
			"阿四哥","55哥","十三哥","大基哥","看热闹·","那啥啊·","没啥货·","da敞亮","扯·犊子","干·哈咧","拉倒·吧","闹哪样@","忆念-Chen.","我不稀罕i",
			"大表姐·","咋整·","·嗯哪","墨·姬","毛·楞","磕`碜","咯`应","打`狼","得`巴","埋·汰","二牛子"};
	public static String[] fuhao = {"❤","☜","☝","★","☺","☀","☚","☟","☛","♦","☆","♈","♉","♊","♋","♌","♎","♏","♐","♑","♓","♒","♍","❃",
			"❀","✿","❉","❈","✲","＊","*","☸","☠","ㄲ","ㅎ","ㅍ","ㄲㅃ","ㅆ","ㅂ","ㅁ","ㄹ","ㄷ","ㄴㄱ","ㅇ","ㅈ","ㅊ","ㅋ","ㅌ","ㅒ","ㅐ","ㅟㅠ","ㅛㅗ","ㅓ","ㅖ","ㅖ","㉵",
			"㉴","㈁","㈀","㈀","㈆","㈊","つ","てこ","㊣","☯","✈","*","＊"};
	public static String[] nogroup = {"惦 念 ","゛微笑↘","沧颜▃","う夜声","゛若久","凝眸う","花 逝╮","強荵▃","爱笑じ","放手 گق","邂逅♛","玩家L-","ゝ九夜°","′芈妖。",
			"﹏颜汐","_浅沫°","ザ琉璃","黒禮菔℡","ミ﹏泡小糖","翠花哥＠","君子傲つ",
			" 朕很萌′","_再生。","冷月魄","南笙离","丶格子夏°","煙花碎·","で毛毛熊","酒、麻醉",
			"墨瞳殇"," 必須丶浪","梦、旧了","℡离城梦","﹀梦里花","离心控°","想、未来","冰琉璃◕‿◕","清风渡","执风挽","︶蓜角","蔸蔸゛猫",
			"初灬嘎","西决丶","惬意","习惯","模糊","憧＂未","傲骨。","吥ぃ乖","丶忧伤","丶宿觞","即使","縌丿噯","-╮求佛ミ","丶落墨","春の恋",
			"冰丶翼","悠闲","静谧","薄姬","崇言ぢ","ゞ寶貝`","疼惜ゞ","┾…·錵心’","H_忘情","蔷薇","唯美","朶儿、","じ☆veヤ情心","↗缘份","逝┆心..","-萝卜-","允芯","晨光°","不二。",
			"丶猫腻","逃离","薄姬","茗灬人","薄幸つ。","﹏゛默笙。","囍战","ζ菇凉","魂俅","安尐熙°","╰つ尛懶蟲℃","哎呦呦",
			"墨尐兮","゛尐兜兜","ぐ尛氣鬼ヤ","憇憇圏","加載中……","-　無愛ゅ","樱*空","淚傾城","24k·純爺們","顏如玉。","夜",
			"迷離","藍小顏°","嘿！豬頭","矜尐持","壞侽朲","﹏顏若惜〆","活雷瘋","★魅影","じòぴé栤哴","﹏ℳ山寨.","光灬年§","必須丶浪","血屠手","梦、旧了","℡离城梦","﹀梦里花","离心控°",
			"蔸蔸゛猫","ゞ揮靃℡ゞ","〆﹏蔓延、","じòぴé魂爷、","掱伈","゛灰烬ゝ","農村範er","雪櫻誮﹡","、￣劇蔠",
			"鴉爿，","、懷念","轀媃の蝎","天、未黑","兜兜、糖","小～雨滴","透心凉。","天℡行者","情，易裂","乳‖孩儿","旧人归。","小情歌*","ι尐吜",
			"╭ァ小雅。","鹏灬鹏","彼岸花。","锁心魂。","歎故人。","离合咒","島域㏒ㄟ","偏執狂.","潮男范-","流浪汉。","旧情人。","夢一场，","唱情歌。","窒息梦。","厭世控ˇ","空白洞。",
			"﹏、淺笑°","|平凡℡","路人乙❗","小宝贝♛","陌丶沫∽","辣条丫。","七忆鱼、","若兮悲″","蔡徐坤.","尐萌轩.","桜世代❁","颖坤玺♡","♡玲珑塔","初相认♂","☘故人北",
			"徐大大@","苏北陌。","栾兮瑾。","顾柒冉.","陈默儿/","小野猫あ","六岁凯～","凯玉呀！","小白纸℡","招搖╰_╯","半符堙","蔺玄觞","九天雪","萧墨尘","凤净松","慕笛安",
			"龙宇昊","十里寂","蔺玄觞","九天雪","萧墨尘","凤净松","慕笛安","-叹服э","·","朶貝.","偷心者※","君莫邪","愁千缕","情花开◎","离人醉","水无忧","小*顽*固","黒禮菔℡","ミ﹏泡小糖",
			"翠花哥＠","君子傲つ","祂丶佷羙","×、自私","寻爱人╮","冷月魄","南笙离","丶格子夏°","煙花碎·","で毛毛熊","酒、麻醉","墨瞳殇","﹌、愛祂","╭⌒雨殇〆","）ㄣ婇渱","烂好人♚",
			"小玲子。","小情绪〆","浪味仙♪","安琳儿∫","苏伊伊","","空无心＆","意中人、","自已伤♪","安浅诺⌒","七秒鱼℡","泥小手.","@南极石","我累了。","摆渡人°","つ.﹏執著",
			"゛﹏晨晨╮","藍尛顏◎","伱不配！","夏末兮り","安尐冉丶","木瑾涼⊕","沐偶亽°","哆兒滾","ツ夢之殤ゞ","小布點。","ヽ喵小囧ミ","☆追夢人ゞ","夏蔚藍°","丿安小陌","﹡κiζs·藍筱妖",
			"﹏、琼琬","ら迷茫","安柒柒.","蓝泡泡♡","心理罪。","鱼七吗？","苏果儿。","暖心人#","二十一.","暮惜哦~","进家族+","小祖宗♡","烂故事.","小情绪〆","顾南玖ѵ","新鲜感.","〢﹎侽兒﹎",
			"〆灬襟區ミ","★、媥秇〃","悲剧ヽ","-界限。","︷＞信仰。","ゞ☆累ㄋ","毁诺。","∩_∩果果","、蓠莂","▁残爱","醉美人。","時光。紀","类似情。","-小疼痛","〤有霸道","▲刺到痛",
			"ぺ爱灬伤人","羽化尘。","碉楼丶简","傻傻ミ爱","向ㄖ葵。","小小懒丶","残伤丶焚","ら゛粉樱花","殘、钰","о初×吻о","他不知","月光蓝","你懂吗","代替品","情绪化","说再见","别离我",
			"好好过","不后悔","时光谣","叫做缘","披头尸","对味儿","矢哲ゝ","㊣ㄑ═小喇叭╮","＠小角色＠","『藍』眼圈～＊","◎單純男◎","、經紀人灬","㇀蓝千月","美人儿￠","殇小魂","隐身娃丶",
			"尐怪獣灬","灬有妖气","撕扯┆《》","【前】男〃友☆","彡恋丿逍灬遥","℡佌愛∨囨","骨人云","卩丬My漁徔吢","丬nicE丶离人泪","▂_那滋味╮","?那份↘綪","心∝釋懷","﹎银雪娇ゝ℡",
			"撩妹控","木槿年。","夜之殇…","雾月凌","冷沐雪","血之召","樱花妖","尛莁嘙","σ._過去式︷","乖ジ别哭","菠萝芯","葬心海","莫、相离","橴荊と颩","念·西风","柒°槿年","忆の江南",
			"胭脂孽▼","魅诱‖迷","梦如初ㄨ","旧少年°","﹏泪无痕","倾城～泪","念旧控゜","冷〤夜轩","浅时光﹏","空心人╮","殇。月夜","烟熏妆ミ","思无邪ら","樱之椛り","离心咒丶","冷顔兒℡",
			"夏丶陌汐","扮红妆〃","櫻花落い","彼岸花゛","莫安凉°","莫念初°","旧容颜゜","潇湘竹△","忆丶凉生","莫相离","瀟湘雨﹌","陌堇夏丶","醉〆紅塵","青柠檬◎","久不遇″","我是谁","我在哪","他想干什么",
			"咿亽丶酔","苏染烟°","瑾年丶曦","笑、倾城","誮╮未央","旧时光°","墨ˋ离汐","陌若惜ヽ","夜丶慬凉","西城诀ァ","乱世人∮","墨ヾ花残°","小男人er","错错错","陌上花","♀伊沐雪』",
			"冷Se调","苏沐熙°","顾小染","シ墨小邪〆","紫薇児","未了情","馥·幽兰","安槿沫","梦雨果er","戒bu掉","冷〤夜轩","失心疯","莓小汐°","简小諾⊕","★゛伊筱沫丶","沫小熙ぃ","ぃ失心控°",
			"仦疯癫ゆ","陌汐夏","樱寳寶","_黑丝控°","Xx.柒小沫","夏。微凉","浅小瞳マ","苏柒若","浅浅爱","慕小迟°","冷眸控丶","﹏乱人心","他的城","小情绪〆゛琉璃丶子","偷鈊de贼",
			"小晴天乀","忆往昔","叹╰明月","顏小兮⊕","沐°小兮","_花染颜_","颜汐夕","我不配℡",">降落伞<","半颗心","罂花°雨","╰彩虹ˇ糖╮","誶誶淰","矮油喂","胸出没","故事与你","不念过去",
			"小花骨朵","言不由衷","小禽兽","爺·24K纯帅","安初夏","与你情深","视你为宝","旧人劫","时光凉薄","勿忘初心","情场剩女","别将就","爺疼伱","菰獨守护","安然浅笑","知你冷暖〆",
			"过分痴迷","风无痕","遇见你","感情戏子","你拥我暖","爱情废柴","暖人心晚笙凉","旧梦已逝","无字情书","浅蓝Sè","借风拥你","恰好心动","夏浅浅","落花听雨","莞尔一笑","宀呗乖乖",
			"孤久厌闹","么么哒o3o","壞籹孖","尘世尽","耳听山风","离人未归","伴你老","悲喜自饮","执手温酒","親伱尐嘴","失訫人","[祭·流年]","尐懶蟲","南小瓜ぴ","╭ァ心丶狠疼か",
			"小呆喵*","加载中……","心下囚","瞌睡虫","◇纞丄伱﹎","糖豆豆*","别皱眉","忆江南","風の影","果小冻","钱权拳","久爱不离","一身宠爱","夏小沫","κiζsヤ月シ","丶默","=ぽ。龙。は=",
			"ぃ傷─〃","義メ","➿槿","妖","","|偲","詇、","༺雅༻","控°","栀璃鸢年","柔若温粥","后会无期","壊先笙罓3罓","旧事酒浓","尐怪兽","咽泪装欢","鱼亡深海","千城墨白",
			"電","ˇＫiζsゞ傷","ั","ζ","泠。","逸","渡。","怼怹恏","旧情话","酒笙清栀","深居她心","挽及清风","北港初晴",
			"久旧酒","薄荷绿ζ","泪染裳","傻丢丢","﹏、嘟尛嘴〆","笑忘初","有點壞Ω","薄荷糖⊕","陌上花","呆萌傻","深栀","李云","尘。","℡花.","﹍Mr.伍℡","℡鍲_を","滥。","雯","醉。",
			"伊。","拽","蕴。","葬","苒。","感悟","璇儿","沵丶不配","ぎ煙燻妝こ","云潇潇。","賤莮春べ","声声慢","ぴ雲淺淺ζ","朕略萌","槑槑猪","メ餹ω馃菋ベ","凹+凸=日",
			"︶尛馋貓","☆﹏淺藍sè","云之遥〆","╰簡單☆噯╮","叮当","大婷","良人","笑靥","守心","呗咦","落雪","云舞","天涯","梓柒","敷衍","虚伪","栀夏","烟凉","久居孤海","安若晴",
			"赱丅呿","傲娇范","挽青丝.","萌二代","少惹Ｗǒ","惢疼ㄋ","旧心酸","负心人","疯人愿","旧时光﹏","猪小哼","错错错","尛脾氣o○","Mé、o尐豬o","氺甁蓙s’","起风了","樱の舞",
			"ぜ樱桃子ぜ","未命名","猫小柒","奥特蛋","o尐懶猫o","互撸娃","怀中人","不二心","不将就","吃藕丑","情未了","れ誮惜颜き","Sunflower゛旧萤火","糖果果℃","喵小咪","风清扬","维他命",
			"闷油瓶","兔寶寶(∩_∩)","故人叹","胭脂泪","孤僻症","尐偏執","風あ淩度ツ","嘘﹏低调ǐ","轻声叹","醉ら逍遥","炸学校","孤心冷","独守心房","梦及深海","预约余生","好梦分你","明夕何夕",
			"征战情书","孤影凭栏","旧梦难回","旧人不负","梦里江山","恍如梦境丿","一纸荒年","北巷孤猫","孤僻成x","惧人心°","初相识","陌路人","痴于你","墨雨汐","誹蕒榀","薄荷凉","韦恩",
			"甄骏","同归","漫长时光","过往幸福","陷入混乱","太过倔强","空城少年","树影摇曳","相顾无言","三分依赖","七分疼爱","青橘栀耳","傲娇萌娃","往日柔情","堇色安年","不够成熟",
			"念你如初","无人街角","反衬绝望","行者","呆瓜","醉笙","绝凌","爱凡","十四","柒冉","毒药","俗人","峰弟","春野","穆臣","洪流","缘尽、情封","ε木偶娃娃","老巷枯井","冷枫メ残月",
			"じ涼城無àì","情深缘浅","孤街旧巷","╰〆浅暮流殇°","笑拥孤独","自欺欺人","镜子别哭","平庸","安泽熙〃","躱貓貓♀","沐小希","碎碎唸〆","凉心人","LOVEの大脸猫","少惹俄","匿名者",
			"㊣經貨","攻心妓","屌丝范゜er","互撸娃","别犯贱","匢莣莪","敗家女ゞ","贱男春","糖小逗","夜孤魂","蝶恋花","JustSoSo","瘋吖頭-.-","﹏躱貓貓＊","等君归","泡泡鱼","24K·純爺們←",
			"尐儍猪^(oo)^","跟风走","法克鱿","醉逍遥","浅薇安","福谷","情臣","百合","材贵","酒醉","伤纸","小了","俗人","朝阳","路途","心愿","也许","阿狸","荒芜","無話可說ソ","泪人怎笑",
			"孤独配酒","过期爱人","無話可說","正在刪除▼","深碍过","寒风残丶","晚风凉","演妓派","烟熏妆","ぁ尐懒猫お","血の祭","喵小懒","厌人心","黑名单","旧容颜゜","安浅夏ら","孤千羽",
			"已加载99.9%","顾暖城","旧青衫゛","白日萌","地狱火","花颜醉","﹏゛小瓶盖◎","旧伤疤","♀蝶ル飞ァ","终如初","陌路人","故人归","天然呆o○","顾清风","何处归",
			"萌二代i","么么熊","我以为","再度流年ァ","自甘堕落","一抹淡粉","心如刀绞","似火煎熬","旧言侵心","安身定命ヾ","得过且过","∝幕落流年╮","雪的泪花","伤感男生","旧时婲开*",
			"旧城失语","╰赤色琉璃","要走趁早","孤岛囚心","暮色之光","樱桃","陌染","哑戏","果子","蜻蜓","山鬼","木北","涼城騷年◎","一季花開°","多啦春梦#","余温未散","心如荒岛","丑，",
			"烂。","侽〝","№愛","情。","伤°","碎。","情。","浮影","き笨豬れ°","&妈抖、","放肆、","如果i","推薦。","☆残↓风★","Ю鉉律℡↘","寡情","、失厺","演绎。ゝ","ぷ彩渱ぷ","風の影",
			"意恁","杂念","♂鉺*釘♀","．·°诱惑","ζジ淩亂﹌","岼滽。","浅爱","◇◆違愛.","莂秂--，","嫊顔","绾青","樱花、Θ","︶ㄣ拽、彬","钟硕","愿否","︵、假装フ","╭Ji莫╮","●蝳葯",
			"メ雨辰ゞヤ","_想念、","∮崽仔々←","思慧。","＋恋情∥。","对白。","久昧","乌白","@怪胎","绝望","岚慧","独路","蔠嚸！ㄣ","╭尛丶柒","&尛﹏璐","夏山、","窗ら外","记号",
			"解脱i","桥雨","╮念n1。","吶、嬡","浪。","浪。","囚。","狠、","梦，","冷月花魂","落花残局づ","落花·惊魂","七年。","男神♞","〆、落幕°","苍白：","か邪殇","冷邑","‰统帅→",
			"爱，哀。","霏羽","つ改变。","疏遇","黛色","罌粟","尛呆，","-烏鴉","-哈猪","深碍i","麥田＆，","随便","初晴っ","独爱，","落寞*"
		};
	public static String[] year = {"1981-","1982-","1983-","1984-","1985-","1986-","1987-","1988-","1989-","1990-","1991-","1992-"};
	public static String[] mounth = {"01-","02-","03-","04-","05-","06-","07-","08-","09-","10-","11-","12-"};
	public static String[] day = {"01","02","03","04","05","06","07","08","09","10","11","12","13","14","15","16","17","18"
			,"19","20","21","22","23","24","25","26","27","28"};
	public static int[] low = {0,0,1,0,0,1,0,0,1,0,0,1,0,0,1,0,0,1,0,0,1,0,0,1,0,0,1,0,0,1,0,0,1,0,0,1,0,0,1,0,0,1,0,0,1,0,0,1,0,0,1,0,0,1,0,0,1,0,0,1,0,0,1,0,0,1,0,0,1,0,0,1,0,0,1,0,0,1,0,0,1};
	public static String getUserIp(String userId) {
		if(ipMap.containsKey(userId)) {
			return ipMap.get(userId);
		}
		return getIp();
	}
	
	public static String getIp() {
		int index = new Random().nextInt(ips.length);
		return ips[index];
	}
	
	public static String[] getUserIds() {
		String userId = PropertiesUtil.getValue("userId");
		if(StringUtils.isNotEmpty(userId)) {
			String[] userIds = userId.split(",");
			return userIds;
		}
		return null;
	}

	public static String getUserId() {
		String userId = PropertiesUtil.getValue("userId");
		if(StringUtils.isNotEmpty(userId)) {
			String[] userIds = userId.split(",");
			int index = new Random().nextInt(userIds.length);
			return userIds[index];
		}
		return "";
	}
	
	public static String getListener() {
		String listener = PropertiesUtil.getValue("listener");
		if(StringUtils.isNotEmpty(listener)) {
			return listener;
		}
		return "";
	}
	
	public static String getRoomId() {
		String roomId = PropertiesUtil.getValue("roomId");
		if(StringUtils.isNotEmpty(roomId)) {
			String[] roomIds = roomId.split(",");
			int index = new Random().nextInt(roomIds.length);
			return roomIds[index];
		}
		return "";
	}
	
	public static String getPwd() {
		String pwd = PropertiesUtil.getValue("pwd");
		if(StringUtils.isNotEmpty(pwd)) {
			return pwd;
		}
		return "";
	}
	
	public static int getTotal() {
		int total = Integer.parseInt(PropertiesUtil.getValue("total"));
		return total;
	}
	
	public static int getRandom(int minValue,int maxValue)
	{
		int returnValue=minValue;
		new java.util.Random();
		returnValue=(int)((maxValue-minValue)*Math.random()+minValue);
		return returnValue;
	}
	public static String getNickname(String userId) {
		int type = -1; // 默认不组合
		String name = "";
		boolean isRename = false; // 是否有重命名过
		if(nameMap.containsKey(userId)) {
			type = nameMap.get(userId);
			isRename = true;
		}
		if(isRename) {
			if(type == 0) { //        特殊符号 + 单个字 + 特殊符号
				type = getRandom(1, 7);
			} else if(type == 1) { // 特殊符号 + 单个字 + 特殊符号 + 两个字
				int[] types = {0,3,2,4,6,5};
				type = types[new Random().nextInt(types.length)];
			} else if(type == 2) { // 特殊符号 + 单个字 + 特殊符号 + 三个字
				int[] types = {0,3,1,4,6,5};
				type = types[new Random().nextInt(types.length)];
			} else if(type == 3) { // 特殊符号 + 两个字 + 特殊符号
				int[] types = {0,6,1,4,2,5};
				type = types[new Random().nextInt(types.length)];
			} else if(type == 4) { // 特殊符号 + 两个字  + 特殊符号 + 单个字
				int[] types = {0,3,1,5,6,2};
				type = types[new Random().nextInt(types.length)];
			} else if(type == 5) { // 特殊符号 + 三个字  + 特殊符号
				int[] types = {0,3,1,4,6,2};
				type = types[new Random().nextInt(types.length)];
			} else if(type == 6) { // 特殊符号 + 三个字  + 特殊符号 + 单个字
				int[] types = {0,3,1,5,2,4};
				type = types[new Random().nextInt(types.length)];
			} else {
				getRandom(0, 7);
			}
		} 
		name = getName(type);
		nameMap.put(userId, type);
		return name;
	}
	
	private static String getName(int type) {
		String name = "";
		if(type == 0) { //        特殊符号 + 单个字 + 特殊符号
			name = fuhao[getRandom(1, fuhao.length)] + one[getRandom(1, one.length)] + fuhao[getRandom(1, fuhao.length)];
		} else if(type == 1) { // 特殊符号 + 单个字 + 特殊符号 + 两个字
			name = fuhao[getRandom(1, fuhao.length)] + one[getRandom(1, one.length)];
		} else if(type == 2) { // 特殊符号 + 单个字 + 特殊符号 + 三个字
			name = one[getRandom(1, one.length)] + fuhao[getRandom(1, fuhao.length)];
		} else if(type == 3) { // 特殊符号 + 两个字 + 特殊符号
			name = two[getRandom(1, two.length)];
		} else if(type == 4) { // 特殊符号 + 两个字  + 特殊符号 + 单个字
			name = two[getRandom(1, two.length)];
		} else if(type == 5) { // 特殊符号 + 三个字  + 特殊符号
			name = thr[getRandom(1, thr.length)];
		} else if(type == 6) { // 特殊符号 + 三个字  + 特殊符号 + 单个字
			name = thr[getRandom(1, thr.length)];
		} else { // 特殊符号 + 不需要组合的 + 特殊符号
			name = nogroup[getRandom(1, nogroup.length)];
		}  
		return name;
	}
	
	/**
	 * 如果昵称重复，则再加一些符合
	 * @return
	 */
	public static String reSetNickname(String nickname) {
		return nickname + fuhao[getRandom(1, fuhao.length)];
	}
	
	public static String getRemark(String userId) {
		if(remarkMap.contains(userId)) {
			return "";
		}
		String rem = remark[getRandom(0,remark.length)];
		if(StringUtils.isEmpty(rem)) {
			rem = "暂无";
		}
		return rem;
	}
	
	public static String getBrithday(String userId) {
		if(briMap.contains(userId)) {
			return "";
		}
		String y = year[getRandom(0, year.length)];
		String m = mounth[getRandom(0, mounth.length)];
		String d = day[getRandom(0, day.length)];
		return y+m+d;
	}
	
	public static boolean isTrue() {
		if(low[getRandom(0,low.length)] % 2 == 0) {
			return true;
		}
		return false;
	}
}
